## Задача №4:
#
# В соседнем районе рождественские эльфы готовят подарки для жителей города.
# Для каждого подарка (файл data/4.txt) нужно найти сколько оберточной бумаги потребуется.
# Формула рассчета: 2*ш*д + 2*д*в + 2*в*ш + площадь наименьшей стороны
# Например, на подарок размером 2х3х4 требуется 2*6 + 2*12 + 2*8 = 52 + 6 кв. см.
#
# Сколько всего оберточной бумаги нужно купить эльфам?
#
## Требования к решению:
# - Входные данные находятся в файле data/4.txt
# - В значениях данные длины, ширины и высоты не упорядочены и могут идти в любом порядке, однако
# длина всегда наименьшее число из трех, высота - среднее, ширина - самое большое.
# - Результат должен быть выведен в консоль командой puts
#
#
## Решение:
file = File.new('/home/runner/work/SP-TN-test-assignment-5-Sleader-m1/SP-TN-test-assignment-5-Sleader-m1/data/4.txt','r:UTF-8')

sizes = file.read.split("\n")
result = 0
for i in sizes 
	helperI = i.split('x').map(&:to_i).sort
	result += 2*helperI[0]*helperI[1] + 2*helperI[0]*helperI[2] + 2*helperI[1]*helperI[2] + helperI[0] * helperI[1]
end
file.close
puts result

